<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"405e9dc71b81154421f818559e8962d6a78ecda9f122c08bf60535f236b1907e","plan_job_ref":"Job terraform_dev_pr #28 at https://github.com/synv-09/tf-github-action/actions/runs/7594061708","plan_out_hash":"56a0eb8c080ae1ba9a19e6ba6d20e87db79900ada07998c35a8bedef420b03ad","plan_hash":"0fbaaa6792a3ddb92c605cd324039136438e9cd5d81e889bf10f05700edef300","plan_text_format":"diff","version":"1.41.1"} -->
Terraform plan in __./environments/dev__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.demo will be created
+   resource "aws_s3_bucket" "demo" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "synv-demo"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "Environment" = "dev"
+           "Project"     = "synv"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform_dev_pr #28](https://github.com/synv-09/tf-github-action/actions/runs/7594061708)